In [163]:
import ibm_db

In [164]:
#Replace the placeholder values with the actuals for your Db2 Service Credentials
dsn_driver = "{IBM DB2 ODBC DRIVER}"
dsn_database = "BLUDB"            # e.g. "BLUDB"
dsn_hostname = "dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net" # e.g.: "dashdb-txn-sbox-yp-dal09-04.services.dal.bluemix.net"
dsn_port = "50000"                    # e.g. "50000" 
dsn_protocol = "TCPIP"            # i.e. "TCPIP"
dsn_uid = "ggm69112"                 # e.g. "abc12345"
dsn_pwd = "s3n6vdfg+tm93fw5"                 # e.g. "7dBZ3wWt9XN6$o0J"

In [165]:
#Create database connection
#DO NOT MODIFY THIS CELL. Just RUN it with Shift + Enter
dsn = (
    "DRIVER={0};"
    "DATABASE={1};"
    "HOSTNAME={2};"
    "PORT={3};"
    "PROTOCOL={4};"
    "UID={5};"
    "PWD={6};").format(dsn_driver, dsn_database, dsn_hostname, dsn_port, dsn_protocol, dsn_uid, dsn_pwd)

try:
    conn = ibm_db.connect(dsn, "", "")
    print ("Connected to database: ", dsn_database, "as user: ", dsn_uid, "on host: ", dsn_hostname)

except:
    print ("Unable to connect: ", ibm_db.conn_errormsg() )

Connected to database:  BLUDB as user:  ggm69112 on host:  dashdb-txn-sbox-yp-lon02-02.services.eu-gb.bluemix.net

In [166]:
#Lets first drop the table INSTRUCTOR in case it exists from a previous attempt
dropQuery1 = "drop table Worker"
dropQuery2 = "drop table Bonus"
dropQuery3 = "drop table Title"

#Now execute the drop statment
dropStmt = ibm_db.exec_immediate(conn, dropQuery1)
dropStmt = ibm_db.exec_immediate(conn, dropQuery2)
dropStmt = ibm_db.exec_immediate(conn, dropQuery3)

In [167]:
#Construct the Create Table DDL statement - replace the ... with rest of the statement
createQuery_1 = "CREATE TABLE Worker \
    (WORKER_ID INT NOT NULL PRIMARY KEY, FIRST_NAME CHAR(25), LAST_NAME CHAR(25),SALARY FLOAT(20), JOINING_DATE VARCHAR(20),DEPARTMENT CHAR(25) )" 
createQuery_2 = "CREATE TABLE Bonus (WORKER_REF_ID INT,BONUS_AMOUNT float(10),BONUS_DATE VARCHAR(20),FOREIGN KEY (WORKER_REF_ID)REFERENCES Worker(WORKER_ID) ON DELETE CASCADE)"
createQuery_3 = "CREATE TABLE Title (WORKER_REF_ID INT,WORKER_TITLE CHAR(25),AFFECTED_FROM VARCHAR(20),FOREIGN KEY (WORKER_REF_ID)REFERENCES Worker(WORKER_ID) ON DELETE CASCADE )"

#Now fill in the name of the method and execute the statement
createStmt_1 = ibm_db.exec_immediate(conn, createQuery_1)
createStmt_2 = ibm_db.exec_immediate(conn, createQuery_2)
createStmt_3 = ibm_db.exec_immediate(conn, createQuery_3)

In [168]:
#Construct the query - replace ... with the insert statement
insertQuery = "INSERT INTO Worker \
    (WORKER_ID, FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT) \
    VALUES \
    (001, 'Monika', 'Arora', 100000, '14-02-20 09.00.00', 'HR'), \
    (002, 'Niharika', 'Verma', 80000, '14-06-11 09.00.00', 'Admin'), \
    (003, 'Vishal', 'Singhal', 300000, '14-02-20 09.00.00', 'HR'), \
    (004, 'Amitabh', 'Singh', 500000, '14-02-20 09.00.00', 'Admin'), \
    (005, 'Vivek', 'Bhati', 500000, '14-06-11 09.00.00', 'Admin'), \
    (006, 'Vipul', 'Diwan', 200000, '14-06-11 09.00.00', 'Account'), \
    (007, 'Satish', 'Kumar', 75000, '14-01-20 09.00.00', 'Account'), \
    (008, 'Geetika', 'Chauhan', 90000, '14-04-11 09.00.00', 'Admin');"

#execute the insert statement
insertStmt = ibm_db.exec_immediate(conn, insertQuery)

In [169]:
#replace ... with the insert statement that inerts the remaining two rows of data
insertQuery2 = "INSERT INTO Bonus \
    (WORKER_REF_ID, BONUS_AMOUNT, BONUS_DATE) VALUES \
    (001, 5000, '16-02-20'), \
    (002, 3000, '16-06-11'), \
    (003, 4000, '16-02-20'), \
    (001, 4500, '16-02-20'), \
    (002, 3500, '16-06-11');"

#execute the statement
insertStmt2 = ibm_db.exec_immediate(conn, insertQuery2)

In [170]:
#replace ... with the insert statement that inerts the remaining two rows of data
insertQuery3 = "INSERT INTO Title  \
 (WORKER_REF_ID, WORKER_TITLE, AFFECTED_FROM) VALUES \
 (001, 'Manager', '2016-02-20 00:00:00'), \
 (002, 'Executive', '2016-06-11 00:00:00'), \
 (008, 'Executive', '2016-06-11 00:00:00'), \
 (005, 'Manager', '2016-06-11 00:00:00'), \
 (004, 'Asst. Manager', '2016-06-11 00:00:00'), \
 (007, 'Executive', '2016-06-11 00:00:00'), \
 (006, 'Lead', '2016-06-11 00:00:00'), \
 (003, 'Lead', '2016-06-11 00:00:00');"

#execute the statement
insertStmt3 = ibm_db.exec_immediate(conn, insertQuery3)

In [171]:
#Construct the query that retrieves all rows from the INSTRUCTOR table
selectQuery_1 = "select * from WORKER"

#Execute the statement
selectStmt_1 = ibm_db.exec_immediate(conn, selectQuery_1)

#Fetch the Dictionary (for the first row only) - replace ... with your
ibm_db.fetch_both(selectStmt_1)

{'WORKER_ID': 1,
 0: 1,
 'FIRST_NAME': 'Monika                   ',
 1: 'Monika                   ',
 'LAST_NAME': 'Arora                    ',
 2: 'Arora                    ',
 'SALARY': 100000.0,
 3: 100000.0,
 'JOINING_DATE': '14-02-20 09.00.00',
 4: '14-02-20 09.00.00',
 'DEPARTMENT': 'HR                       ',
 5: 'HR                       '}

In [172]:
#Construct the query that retrieves all rows from the INSTRUCTOR table
selectQuery_2 = "select * from Bonus"

#Execute the statement
selectStmt_2 = ibm_db.exec_immediate(conn, selectQuery_2)

#Fetch the Dictionary (for the first row only) - replace ... with your
ibm_db.fetch_both(selectStmt_2)

{'WORKER_REF_ID': 1,
 0: 1,
 'BONUS_AMOUNT': 5000.0,
 1: 5000.0,
 'BONUS_DATE': '16-02-20',
 2: '16-02-20'}

In [173]:
#Construct the query that retrieves all rows from the INSTRUCTOR table
selectQuery_3 = "select * from Title"

#Execute the statement
selectStmt_3 = ibm_db.exec_immediate(conn, selectQuery_3)

#Fetch the Dictionary (for the first row only) - replace ... with your
ibm_db.fetch_both(selectStmt_3)

{'WORKER_REF_ID': 1,
 0: 1,
 'WORKER_TITLE': 'Manager                  ',
 1: 'Manager                  ',
 'AFFECTED_FROM': '2016-02-20 00:00:00',
 2: '2016-02-20 00:00:00'}

In [174]:
#Fetch the rest of the rows and print the ID and FNAME for those rows
while ibm_db.fetch_row(selectStmt_1) != False:
   print (" WORKER_ID:",  ibm_db.result(selectStmt_1, 0), " FIRST_NAME:",  ibm_db.result(selectStmt_1, "FIRST_NAME"))

 WORKER_ID: 2  FIRST_NAME: Niharika
 WORKER_ID: 3  FIRST_NAME: Vishal
 WORKER_ID: 4  FIRST_NAME: Amitabh
 WORKER_ID: 5  FIRST_NAME: Vivek
 WORKER_ID: 6  FIRST_NAME: Vipul
 WORKER_ID: 7  FIRST_NAME: Satish
 WORKER_ID: 8  FIRST_NAME: Geetika

In [175]:
import pandas
import ibm_db_dbi

In [176]:
#connection for pandas
pconn = ibm_db_dbi.Connection(conn)

In [177]:
#query statement to retrieve all rows in INSTRUCTOR table
selectQuery1 = "select * from Worker"

#retrieve the query results into a pandas dataframe
pdf = pandas.read_sql(selectQuery1, pconn)

#print just the LNAME for first row in the pandas data frame
pdf

,WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT
0,1,Monika,Arora,100000.0,14-02-20 09.00.00,HR
1,2,Niharika,Verma,80000.0,14-06-11 09.00.00,Admin
2,3,Vishal,Singhal,300000.0,14-02-20 09.00.00,HR
3,4,Amitabh,Singh,500000.0,14-02-20 09.00.00,Admin
4,5,Vivek,Bhati,500000.0,14-06-11 09.00.00,Admin
5,6,Vipul,Diwan,200000.0,14-06-11 09.00.00,Account
6,7,Satish,Kumar,75000.0,14-01-20 09.00.00,Account
7,8,Geetika,Chauhan,90000.0,14-04-11 09.00.00,Admin

### Q-1. Write An SQL Query To Fetch “FIRST_NAME” From Worker Table Using The Alias Name As 'WORKER_NAME'.

In [178]:
selectQuery1 = "select first_name as WORKER_NAME from Worker"

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

                 WORKER_NAME
0  Monika
1  Niharika
2  Vishal
3  Amitabh
4  Vivek
5  Vipul
6  Satish
7  Geetika

### Q-2. Write An SQL Query To Fetch “FIRST_NAME” From Worker Table In Upper Case.

In [179]:
selectQuery1 = "select UPPER(first_name) as WORKER_NAME from Worker"

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

                 WORKER_NAME
0  MONIKA
1  NIHARIKA
2  VISHAL
3  AMITABH
4  VIVEK
5  VIPUL
6  SATISH
7  GEETIKA

### Q-3. Write An SQL Query To Fetch Unique Values Of DEPARTMENT From Worker Table.

In [180]:
selectQuery1 = "select DISTINCT DEPARTMENT as UNIQUE_DEPT from Worker"

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

                 UNIQUE_DEPT
0  Account
1  Admin
2  HR

### Q-4. Write An SQL Query To Print The First Three Characters Of  FIRST_NAME From Worker Table.

In [181]:
selectQuery1 = "select substring(first_name, 1,3) as WORKER_NAME from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

  WORKER_NAME
0         Mon
1         Nih
2         Vis
3         Ami
4         Viv
5         Vip
6         Sat
7         Gee

### Q-5. Write An SQL Query To Find The Position Of The Alphabet (‘A’) In The First Name Column ‘Amitabh’ From Worker Table.

In [183]:
selectQuery1 = "select INSTR(first_name, 'a') from Worker where first_name = 'Amitabh' "
#selectStmt1 = ibm_db.exec_immediate(conn, selectQuery1)

#ibm_db.fetch_both(selectStmt1)
pdf = pandas.read_sql(selectQuery1, pconn)

pdf

   1
0  5

### Q-6. Write An SQL Query To Print The FIRST_NAME From Worker Table After Removing White Spaces From The Right Side.

In [184]:
selectQuery1 = "select RTRIM(first_name) as WORKER_NAME from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

  WORKER_NAME
0      Monika
1    Niharika
2      Vishal
3     Amitabh
4       Vivek
5       Vipul
6      Satish
7     Geetika

### Q-7. Write An SQL Query To Print The DEPARTMENT From Worker Table After Removing White Spaces From The Left Side.

In [185]:
selectQuery1 = "select LTRIM(DEPARTMENT) as DEPARTMENT from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

                  DEPARTMENT
0  HR
1  Admin
2  HR
3  Admin
4  Admin
5  Account
6  Account
7  Admin

### Q-8. Write An SQL Query That Fetches The Unique Values Of DEPARTMENT From Worker Table And Prints Its Length.

In [186]:
selectQuery1 = "select DEPARTMENT, COUNT(DEPARTMENT) as DEPARTMENT_COUNT from Worker GROUP BY DEPARTMENT"
selectQuery2 = "select DISTINCT LENGTH(DEPARTMENT) from Worker"

pdf1 = pandas.read_sql(selectQuery1, pconn)
pdf2 = pandas.read_sql(selectQuery2, pconn)

print(pdf1)
print(pdf2)

                  DEPARTMENT  DEPARTMENT_COUNT
0  Account                                 2.0
1  Admin                                   4.0
2  HR                                      2.0
    1
0  25

### Q-9. Write An SQL Query To Print The FIRST_NAME From Worker Table After Replacing ‘a’ With ‘A’.

In [200]:
selectQuery1 = "select REPLACE(FIRST_NAME,'a','A') as NEW_FIRST_NAME from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

              NEW_FIRST_NAME
0  MonikA
1  NihArikA
2  VishAl
3  AmitAbh
4  Vivek
5  Vipul
6  SAtish
7  GeetikA

###  Q-10. Write An SQL Query To Print The FIRST_NAME And LAST_NAME From Worker Table Into A Single Column COMPLETE_NAME. A Space Char Should Separate Them.

In [199]:
selectQuery1 = "select first_name || '' || last_name as COMPLETE_NAME from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

                                       COMPLETE_NAME
0  Monika                   Arora                ...
1  Niharika                 Verma                ...
2  Vishal                   Singhal              ...
3  Amitabh                  Singh                ...
4  Vivek                    Bhati                ...
5  Vipul                    Diwan                ...
6  Satish                   Kumar                ...
7  Geetika                  Chauhan              ...

### Q-11. Write An SQL Query To Print All Worker Details From The Worker Table Order By FIRST_NAME Ascending.

### Q-12. Write An SQL Query To Print All Worker Details From The Worker Table Order By FIRST_NAME Ascending And DEPARTMENT Descending.

### Q-13. Write An SQL Query To Print Details For Workers With The First Name As “Vipul” And “Satish” From Worker Table.

### Q-14. Write An SQL Query To Print Details Of Workers Excluding First Names, “Vipul” And “Satish” From Worker Table.

### Q-15. Write An SQL Query To Print Details Of Workers With DEPARTMENT Name As “Admin”.

### Q-16. Write An SQL Query To Print Details Of The Workers Whose FIRST_NAME Contains ‘A’.

### Q-17. Write An SQL Query To Print Details Of The Workers Whose FIRST_NAME Ends With ‘A’.

### Q-18. Write An SQL Query To Print Details Of The Workers Whose FIRST_NAME Ends With ‘H’ And Contains Six Alphabets.

### Q-19. Write An SQL Query To Print Details Of The Workers Whose SALARY Lies Between 100000 And 500000.

In [201]:
selectQuery1 = "select * from Worker where salary between 100000 and 500000 "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

,WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT
0,1,Monika,Arora,100000.0,14-02-20 09.00.00,HR
1,3,Vishal,Singhal,300000.0,14-02-20 09.00.00,HR
2,4,Amitabh,Singh,500000.0,14-02-20 09.00.00,Admin
3,5,Vivek,Bhati,500000.0,14-06-11 09.00.00,Admin
4,6,Vipul,Diwan,200000.0,14-06-11 09.00.00,Account

### Q-20. Write An SQL Query To Print Details Of The Workers Who Have Joined In Feb’2014.

In [249]:
selectQuery1 = "select * from Worker where joining_date like '14-02%' "
pdf = pandas.read_sql(selectQuery1, pconn)

pdf

,WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT
0,1,Monika,Arora,100000.0,14-02-20 09.00.00,HR
1,3,Vishal,Singhal,300000.0,14-02-20 09.00.00,HR
2,4,Amitabh,Singh,500000.0,14-02-20 09.00.00,Admin

### Q-21. Write An SQL Query To Fetch The Count Of Employees Working In The Department ‘Admin’.

In [208]:
selectQuery1 = "select count(*) from Worker where department = 'Admin' "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

     1
0  4.0

### Q-22. Write An SQL Query To Fetch Worker Names With Salaries >= 50000 And <= 100000.

In [212]:
selectQuery1 = "select rtrim(first_name || ' ' || last_name) as Worker_name, salary from Worker where salary between 50000  and 100000 "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

                         WORKER_NAME    SALARY
0    Monika                    Arora  100000.0
1    Niharika                  Verma   80000.0
2    Satish                    Kumar   75000.0
3  Geetika                   Chauhan   90000.0

### Q-23. Write An SQL Query To Fetch The No. Of Workers For Each Department In The Descending Order.

In [214]:
selectQuery1 = "select department, count(worker_id) as no_of_worker from Worker group by department order by no_of_worker desc;  "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

                  DEPARTMENT  NO_OF_WORKER
0  Admin                               4.0
1  Account                             2.0
2  HR                                  2.0

### Q-24. Write An SQL Query To Print Details Of The Workers Who Are Also Managers.

In [221]:
selectQuery1 = "select * from worker where worker_id in (select worker_ref_id from title where worker_title = 'Manager')  "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

,WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT
0,1,Monika,Arora,100000.0,14-02-20 09.00.00,HR
1,5,Vivek,Bhati,500000.0,14-06-11 09.00.00,Admin

### Q-25. Write An SQL Query To Fetch Duplicate Records Having Matching Data In Some Fields Of A Table.

In [228]:
selectQuery1 = "select worker_title, affected_from, count(*) as no_of_duplicate from title group by worker_title, affected_from having count(*)>1; "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

                WORKER_TITLE        AFFECTED_FROM  NO_OF_DUPLICATE
0  Executive                  2016-06-11 00:00:00              3.0
1  Lead                       2016-06-11 00:00:00              2.0

### Q-26. Write An SQL Query To Show Only Odd Rows From A Table.

In [229]:
selectQuery1 = "select * from Worker where  mod (worker_id, 2) <> 0;"

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

,WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT
0,1,Monika,Arora,100000.0,14-02-20 09.00.00,HR
1,3,Vishal,Singhal,300000.0,14-02-20 09.00.00,HR
2,5,Vivek,Bhati,500000.0,14-06-11 09.00.00,Admin
3,7,Satish,Kumar,75000.0,14-01-20 09.00.00,Account

### Q-27. Write An SQL Query To Show Only Even Rows From A Table.

In [230]:
selectQuery1 = "select * from Worker where mod (worker_id ,2) = 0 "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

,WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT
0,2,Niharika,Verma,80000.0,14-06-11 09.00.00,Admin
1,4,Amitabh,Singh,500000.0,14-02-20 09.00.00,Admin
2,6,Vipul,Diwan,200000.0,14-06-11 09.00.00,Account
3,8,Geetika,Chauhan,90000.0,14-04-11 09.00.00,Admin

### Q-28. Write An SQL Query To Clone A New Table From Another Table.

In [255]:
selectQuery1 = "create table workerclone like worker "
Stmt = ibm_db.exec_immediate(conn, selectQuery1)
stmt

 SQLCODE=-601

### Q-29. Write An SQL Query To Fetch Intersecting Records Of Two Tables.

In [256]:
selectQuery1 = "(select * from Worker) intersect (select * from workerclone) "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

Empty DataFrame
Columns: [WORKER_ID, FIRST_NAME, LAST_NAME, SALARY, JOINING_DATE, DEPARTMENT]
Index: []

### Q-30. Write An SQL Query To Show Records From One Table That Another Table Does Not Have.

In [263]:
selectQuery1 = "(select * from Worker) except (select * from workerclone) "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

,WORKER_ID,FIRST_NAME,LAST_NAME,SALARY,JOINING_DATE,DEPARTMENT
0,7,Satish,Kumar,75000.0,14-01-20 09.00.00,Account
1,2,Niharika,Verma,80000.0,14-06-11 09.00.00,Admin
2,8,Geetika,Chauhan,90000.0,14-04-11 09.00.00,Admin
3,1,Monika,Arora,100000.0,14-02-20 09.00.00,HR
4,6,Vipul,Diwan,200000.0,14-06-11 09.00.00,Account
5,3,Vishal,Singhal,300000.0,14-02-20 09.00.00,HR
6,4,Amitabh,Singh,500000.0,14-02-20 09.00.00,Admin
7,5,Vivek,Bhati,500000.0,14-06-11 09.00.00,Admin

### Q-31. Write An SQL Query To Show The Current Date And Time.

In [267]:
selectQuery1 = "select DATETIME('now','localtime') "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

DatabaseError: Execution failed on sql 'select DATETIME('now','localtime') ': ibm_db_dbi::ProgrammingError: Exception('SQLNumResultCols failed: [IBM][CLI Driver][DB2/LINUXX8664] SQL0104N  An unexpected token "END-OF-STATEMENT" was found following "E(\'now\',\'localtime\')".  Expected tokens may include:  "<table_expr>".  SQLSTATE=42601\r SQLCODE=-104')

### Q-32. Write An SQL Query To Show The Top N (Say 10) Records Of A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-33. Write An SQL Query To Determine The Nth (Say N=5) Highest Salary From A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-34. Write An SQL Query To Determine The 5th Highest Salary Without Using TOP Or Limit Method.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-35. Write An SQL Query To Fetch The List Of Employees With The Same Salary.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-36. Write An SQL Query To Show The Second Highest Salary From A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-37. Write An SQL Query To Show One Row Twice In Results From A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-38. Write An SQL Query To Fetch Intersecting Records Of Two Tables.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-39. Write An SQL Query To Fetch The First 50% Records From A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-40. Write An SQL Query To Fetch The Departments That Have Less Than Five People In It.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-41. Write An SQL Query To Show All Departments Along With The Number Of People In There.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-42. Write An SQL Query To Show The Last Record From A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-43. Write An SQL Query To Fetch The First Row Of A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-44. Write An SQL Query To Fetch The Last Five Records From A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-45. Write An SQL Query To Print The Name Of Employees Having The Highest Salary In Each Department.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-46. Write An SQL Query To Fetch Three Max Salaries From A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-47. Write An SQL Query To Fetch Three Min Salaries From A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-48. Write An SQL Query To Fetch Nth Max Salaries From A Table.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-49. Write An SQL Query To Fetch Departments Along With The Total Salaries Paid For Each Of Them.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf

### Q-50. Write An SQL Query To Fetch The Names Of Workers Who Earn The Highest Salary.

In [ ]:
selectQuery1 = "select * from Worker "

pdf = pandas.read_sql(selectQuery1, pconn)

pdf